const educationlevelhead = [
  "بدون",
  "محو امية",
  "ابتدائي",
  "اعدادي",
  "ثانوي",
  "ثانوي عام",
  "جامعي",
  "دبلوم",
  "ماجستير",
  "دكتوراه",
];

export const rolesHeaders = [
  "حضانة",
  "اولي و تانية ابتدائي",
  "تالتة و رابعة ابتدائي",
  "خامسة و سادسة ابتدائي",
  "احتياجات",
  "اعدادي",
  "ثانوي",
  "شباب",
];

export const classHeaders = [
  { class: "حضانة", classNumbers: [0, 1, 2] },
  { class: "اولي و تانية ابتدائي", classNumbers: [3.4] },
  { class: "تالتة و رابعة ابتدائي", classNumbers: [5, 6] },
  { class: "خامسة و سادسة ابتدائي", classNumbers: [7, 8] },
  { class: "اعدادي", classNumbers: [9, 10, 11] },
  { class: "ثانوي", classNumbers: [12, 13, 14] },
  { class: "احتياجات", classNumbers: [20] },
  { class: "شباب", classNumbers: [15, 16] },
];

export const classDataHeaders = [
  "GPS",
  "ملاحظات",
  "تاريخ الميلاد",
  "التيليفون",
  "العنوان",
  "الاسم",
  "م",
];
const sourceHead = [
  "علي نفقة الدولة",
  "التأمين الصحي",
  "الكنيسة",
  "علي نفقتي الشخصية",
  "مساعدة اشخاص",
];

const disablity_type = [
  "حركة جزئية",
  "حركية كلية",
  "عقلية",
  "سمعية",
  "بصرية",
  "نطقية",
  "سلوكية",
  "نفسية",
];

const marriagestatushead = [
  "متزوج",
  "اعزب",
  "ارمل",
  "منفصل / بطلان زواج",
  "مطلق كنسي",
  "دون سن الزواج",
];
const work_typehead = [
  "موظف حكومي",
  "قطاع خاص",
  "اعمال حرة",
  "ربة منزل",
  "طالب",
  "معاش",
  "في سن العمل ولا يعمل",
  "شرطة",
  "قوات مسلحة",
];

const reson = ["الزوج متوفي", "عاطل", "ترك المنزل", "مريض", "منفصل", "اخري"];

const reltivity = [
  ,
  "اب",
  "ام",
  "ابن",
  "ابنه",
  "عم/عمه",
  "خال/خالة",
  "جد/جدة",
  "حما/حماه",
  "زوجه ابن/زوج ابنه",
  "اخ/اخت الزوج",
  "اخ/اخت الزوجة",
  "ابن/ابنه الزوج",
  "ابن/ابنه الزوجة",
  "حفيد/حفيدة",
  "قرابة اخري",
];

const incomerange = ["اقل من 300 جنية", "300-500", "500-1000", " اكثر من 1000"];

const illnessesHeads = [
  "سرطان",
  "سكر",
  "درن",
  "ضغط",
  "فشل كلوي",
  "مرض كلوي",
  "فيرس سي",
  "ربو",
  "قلب",
  "صرع",
  "تشنجات",
  "مرض كبدي",
  "جهاز تنفسي",
  "جهاز هضمي",
  "مرض بالعين",
  "جهاز تناسلي",
  "القلب",
  "المعدة",
  "الامعاء",
  "اخري",
];

const sourceofmedication = [
  "علي نفقة الدولة",
  "التامين الصحي",
  "الكنيسة",
  "علي نفقتي الخاصة",
  "مساعدة اشخاص",
];

export {
  educationlevelhead,
  sourceofmedication,
  illnessesHeads,
  incomerange,
  work_typehead,
  marriagestatushead,
  disablity_type,
  reltivity,
  sourceHead,
  reson,
};
